{
  "All_Reported_Opinions_Cited_with_Shortened_Bluebook_Citation": "extract every citation to a judicial opinion that includes a reporter or database citation (e.g., 123 F.3d 456; 789 U.S. 321; 2020 WL 4218003). Include the case name if it appears immediately before the citation (ignore signals like \"see,\" \"cf.,\" and commas); otherwise output the citation alone. Output one entry per opinion as \"Case Name, Reporter/Database Citation,\" using shortened Bluebook form if applicable. Strip pincites and parentheticals; if parallel cites appear, keep only the first. Exclude id./supra/infra, docket-only references, slip opinions without a reporter/database cite, and non-case sources (statutes, rules, articles).",
  "Appeal": "identify whether any appeals are mentioned, including which parties filed the appeal and to which court and provide the extracted information. If applicable, clearly state the information using the following format: \"Appeal: [parties] appealed to [court].\" Try to be as completely as possible.",
  "Cause_of_Action": "identify the cause of action, including whether it refers to a statute (e.g., 42 USC 1983) or a case (e.g., Ex Parte Young). Extract the crucial cause of action information as completely as possible.",
  "Class_Action_or_Individual_Plaintiffs": "identify whether the case involves class action plaintiffs or individual plaintiffs. Clearly state the information using the following format: \"Plaintiffs: Class Action\" if it is a class action, or \"Plaintiffs: Individual, described as [description]\" if individual plaintiffs are involved.",
  "Consolidated_Cases_Noted": "identify whether any consolidated cases are mentioned and extract the crucial consolidated cases information as completely as possible. Do not list the current case as its own related/consolidated matter.",
  "Court_Rulings": "identify the court's decisions or orders in sequence. Capture the court level, date (if provided), and whether later rulings modify or reverse earlier ones. Focus on concise descriptions of outcomes (granted/denied) for key motions or issues, such as: granted/denied motions to dismiss, granted/denied summary judgment, issued preliminary injunctions or TROs, certified/denied class certification, or other significant rulings.",
  "Date_of_Settlement": "extract settlement dates with the court level if provided, and note whether the settlement supersedes prior orders. If applicable, clearly state the information using the following format: \"[date]: [settlement].\"",
  "Dates_of_All_Decrees": "identify dates of decrees and the issuing court. Extract all such information as completely as possible. If applicable, clearly state each item using the following format: \"[date]: [court]: [decree].\"",
  "Disputes_Over_Settlement_Enforcement": "extract disputes over settlement enforcement, noting when they arise and whether they modify or challenge prior settlements.",
  "Factual_Basis_of_Case": "extract the facts or evidence upon which the case is built, in the order they emerge. Note how the factual narrative changes or expands over time. This typically includes: 1. Details of the relevant events—what happened, when it happened, where it happened, and who was involved. 2. Evidence – physical evidence, documentary records, witness testimonies, etc., that support these facts. 3. Background information—context or explanatory facts that provide additional understanding.",
  "Filing_Date": "extract the case filing date—when the lawsuit was first initiated. Extract the crucial information as completely as possible.",
  "First_and_Last_name_of_Judge": "identify judges in the order they appear (initial assignment, reassignments, appellate panels). Note the court level with each name so later judges can be understood as replacing or superseding prior judges. Example output format: \"[court level]: [full name]\"; if only last name appears, output the last name with the level.",
  "How_Long_Decrees_will_Last": "extract the duration of all decrees, noting issuance/modification dates when present. Extract crucial related information as completely as possible. If applicable, clearly state the information using the following format: \"[date]: [duration]: [decree].\"",
  "How_Long_Settlement_will_Last": "extract the duration of all settlements information, noting the date and whether it supersedes prior orders. If applicable, clearly state the information using the following format: \"[date]: [duration]: [settlement].\"",
  "Monitor_Reports": "identify references to monitoring activities or compliance reviews mentioned in the documents. Extract concise information about: (1) what is being monitored, (2) key findings or compliance status if mentioned, (3) dates of monitoring activities if available. Focus on summarizing the monitoring outcomes rather than extracting entire reports. Format as brief statements like: 'Monitor found [compliance/non-compliance] with [specific requirement] as of [date]'. Limit to the most significant monitoring findings only.",
  "Name_of_the_Monitor": "identify whether a monitor was appointed and note the name of the monitor if mentioned.",
  "Note_Important_Filings": "identify important filings or motions in the order they occur (TROs, PIs, motions to dismiss, motions for summary judgment, etc.). Include the filing court/level and date if provided so the sequence of filings is clear.",
  "Related_Cases_Listed_by_Their_Case_Code_Number": "identify whether any related cases are listed by their case code number and extract the crucial consolidated cases information as completely as possible. Exclude the current case itself; do not echo its docket or caption or similar as related.",
  "Remedy_Sought": "extract the remedy sought (e.g., declaratory judgment) information. Extract the crucial remedy sought information as completely as possible.",
  "Significant_Terms_of_Decrees": "extract the significant terms of decrees information. Significant terms means the substance of the decree. In a decree, the judge orders the defendants to do something. The significant terms would be what the defendants are ordered/agree to do. Extract the crucial significant terms of decrees information as completely as possible.",
  "Significant_Terms_of_Settlement": "extract the significant terms of settlements information. Significant terms means the substance of the settlement. In a settlement, the parties agree to do something. The significant terms would be what the parties agreed to do. Extract significant terms of settlements information as completely as possible.",
  "Statutory_or_Constitutional_Basis_for_the_Case": "extract the statutory or constitutional basis for the case, including any relevant constitutional clauses and amendments if applicable. A case can either be based on a statute or a provision of the Constitution--i.e., a case will either claim that someone violated a statute, or violated the Constitution. For cases that have a constitutional basis, the documents should refer to the clause of the Constitution that was allegedly violated, as well as the amendment if applicable. For example it would say \"the plaintiffs alleged violations of the Fourteenth Amendment's Equal Protection Clause,\" or \"the plaintiffs alleged violations of the Commerce Clause.\"",
  "Trials": "extract information about all trials mentioned in the documents as completely as possible. The trial information includes things like scheduling, proceedings, outcomes, and any related motions or rulings.",
  "Type_of_Counsel": "identify the type of counsel mentioned (such as private, legal services, ACLU, etc.).",
  "Whether_the_Settlement_is_Court-enforced_or_Not": "identify whether the settlement is court-enforced. If applicable, clearly state the result using the following format: \"[Yes/No].\"",
  "Who_are_the_Parties": "identify the description of the parties involved. Provide details about each plaintiff and defendant, including any relevant positions or offices held if applicable. Extract each individual party as a separate entry in the extracted list. If there are multiple plaintiffs or multiple defendants, create a distinct entry for each person or entity. Each value should follow this format: \"Plaintiff: [description]\" or \"Defendant: [description]\". Try to be as complete as possible."
}
